Pemrograman Berorientasi Objek/app/Models/M_karyawan.php

    function cek_login($no_karyawan,) {
        return $this->getWhere(['no_karyawan' => $no_karyawan]);
---
SELECT *
FROM `karyawan`
WHERE `no_karyawan` = 'IE03'